Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཐང་ཅིག་དང་། སྐད་ཅིག་དང་། ཡུད་ཙམ་གྱིས་མཐོང་བ་ནི་ང་དང་མཉམ་པ་དང་།
en: Such a person is equal to me.

source: མི་མཉམ་པ་ཡིན་ནོ་ཞེས་སྨྲའོ།
en: I can say he is exactly the same as me.

source: །བདག་ནི་སེམས་ཅན་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཡིན་པར་ཡང་འཛིན་ཏེ། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ཡིན་པས་སྤྱི་བོས་དབང་བསྐུར་བར་བགྱིའོ།
en: I hold him in the high esteem that is due to a tathāgata, and I nurture him in both a worldly and supramundane way.

source: །རིག་སྔགས་འཆང་བས་ཟུང་ཤིག་དང་།
en: Accept, O vidyā holder, any boon you choose!

source: མཆོག་ཇི་ལྟར་འདོད་པ་དང་། ཇི་ལྟར་ཡིད་ལ་རེ་བ་དང་། བསམ་པ་ཐམས་ཅད་རྗེས་སུ་གཟུང་ཞིང་སྦྱིན་པར་མཛད་དོ།
en: I will grant whatever wishes or desires you may have.’ “

source: །དེའི་ཚེ་རིག་སྔགས་འཆང་བས་ཡིད་ལ་ཇི་ལྟར་བསམས་པའི་མཆོག་སྨྲས་ན།
en: At that point, the vidyā holder should announce whatever wishes he has, and Noble Avalokiteśvara will grant them all.

source: དེ་ཐམས་ཅད་སྦྱིན་པར་མཛད་ཅིང་དོན་ཡོད་པའི་ཡེ་ཤེས་བཀོད་པ་རྣམ་པར་གྲོལ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ། །གཞན་ཡང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བཅུའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: The vidyā holder will obtain the samādhi called the pure, liberating display of amogha knowledge, as well as hundreds of thousands of other samādhis as numerous as the grains of sand in ten million Gaṅgā rivers.

source: །རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ།
en: He will be able to travel through space using his magical power. “

source: །དཀྱིལ་འཁོར་དེའི་དམ་ཚིག་ཏུ་ཞུགས་པ་ནི་དམ་ཚིག་ཤེས་པའི་རྗེས་སུ་ཞུགས་པ་ཡིན་ཏེ། དེ་དག་ཐམས་ཅད་ས་བཅུ་ལ་རབ་ཏུ་གནས་པ་ཡིན། འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་ཕྱིར་མི་ལྡོག་པ་ཐོབ་པར་འགྱུར་བ་ཡིན། ལུང་བསྟན་པ་དང་བྱིན་གྱིས་བརླབས་པར་འགྱུར་བ་ཡིན།
en: All those who enter this maṇḍala and gain an understanding of its samaya will be established on the ten bodhisattva levels and reach the point of no return, as their prophesied unsurpassable perfect awakening cannot be undone.

source: དེ་ནི་མངལ་ན་གནས་པར་སྐྱེ་བའི་ཐ་མ་སྟེ། ཕྱིས་མང་ལན་གནས་པའི་དྲི་མས་གོས་པར་མི་འགྱུར་རོ།
en: Their current birth will be their last birth from a womb, and they will never again be stained by sojourning in the womb.

source: །ཤི་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་པདྨོའི་ནང་ནས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་རྫུས་ཏེ་སྐྱེས་པར་འགྱུར་རོ།
en: After they leave their present body, they will be born spontaneously from a lotus flower in the realm of Sukhāvatī and be adorned with every ornament.

source: །ཚེ་རབས་ཀུན་ཏུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ། །དོན་ཡོད་པའི་རྒྱལ་པོའི་ཕུན་སུམ་ཚོགས་པ་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ།
en: They will carry their memories with them from birth to birth, and they will be directly introduced to this fortunate blessing of Amogharāja, the great sovereign ritual, the maṇḍala of liberation, the great samaya that leads to the seat of awakening of all the tathāgatas, and to the turning of the wheel of Dharma. “

source: དམ་ཚིག་ཆེན་པོ་འདི་ཁ་ཏོན་བྱེད་ན་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་མཐོང་བར་འགྱུར་རོ།
en: Such beings will behold all the tathāgatas in the ten directions sitting on their seats of awakening in their respective buddha fields.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་ལེགས་སོ་ཞེས་བྱ་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: From each of these tathāgatas they will hear the words of celebration: ‘Good!

source: རིགས་ཀྱི་བུ་སྐྱེ་བ་བླངས་པ་ལེགས་པར་སྐྱེ་བ་ཡིན་པས་ལེགས་སོ་ལེགས་སོ། །ཕྱིར་མི་ལྡོག་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་གནས་པ་ཡིན་ནོ།
en: It is good, O son of good family! You have obtained a good birth and have now been established in the unsurpassable perfect awakening, from which you cannot lapse.’

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་དང་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འོད་ཟེར་འབུམ་ཕྲག་བྱེ་བས་མཛེས་པར་གྱུར་ཅིང་བསོད་ནམས་ཀྱིས་བརྒྱན་པའི་ཕྱག་གསེར་གྱི་མདོག་ཅན་བརྐྱང་ནས་སྤྱི་བོར་ཕྱག་འཇོག་ཅིང་དབུགས་འབྱིན་པར་ཡང་མཛད་དོ།
en: Subsequently, all the tathāgatas, the blessed buddhas in the ten directions, blazing with a hundred thousand light rays and adorned with merit, will extend their golden arm and place their hand upon these beings’ head, giving them comfort and encouragement.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་ཆོས་འབེལ་བའི་གཏམ་མངོན་སུམ་དུ་སྒྲོགས་པར་མཛད་དོ།
en: These beings will hear the full Dharma teachings directly from the tathāgatas until they attain the ultimate and final liberation. “

source: །ཐ་ན་དཀྱིལ་འཁོར་ཆེན་པོ་རོལ་མོའི་སྒྲ་རྔ་བོ་ཆེ་དང་། རྔ་བྲན་དང་། དུང་དང་། རྫ་རྔ་དང་། རོལ་མོའི་སྒྲ་གང་དག་གྲག་པ་ལ་སེམས་ཅན་གང་དག་གིས་སྒྲ་དེ་ཐོས་ནས་རྣ་བའི་བུ་ག་ཙམ་དུ་སོང་བ་དེ་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: If any beings hear the sounds of musical instruments—wind, stringed, or percussion instruments, or conches, kettle drums, or tambourines—played in the maṇḍala, even if the sound merely reaches their ears, they will reach a point of no return on the path to, and subsequently become established in, unsurpassable perfect awakening.

source: །ཐ་ན་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པར་བྱའི་རྣ་བར་སྒྲ་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Even birds and animals who hear these sounds will reach the point of no return.

source: །དེ་ལྟར་ན་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པ་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་མཐུ་ཆེན་པོ་རྣམ་པར་འཕྲུལ་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་པོའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། སེམས་ཅན་གཞན་གང་ཡང་རུང་བ་དགེ་སྦྱོང་ངམ།
en: This liberation-maṇḍala procedure is attended by great marvels and miracles and has great magical power. “

source: བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། རྗེའུའི་རིགས་སམ། དམངས་རིགས་སམ། འགའ་ཞིག་གིས་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འདི་འཁོར་མང་པོའི་ནང་དུ་ཀློག་པ་དང་སེམས་ཅན་གང་གིས་སྒྲ་དེ་ཐོས་ནས་སྒྲ་དབྱངས་དེ་དང་མིང་ཐོས་པ་རྣ་བའི་བུ་གར་སོང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་སྒྲིབ་པ་དང་།
en: Any son or daughter of good family, a monk or nun, a male or female lay practitioner, or any other being—whether they are an ascetic, brahmin, kṣatriya, vaiśya, or śūdra—who proclaims this liberation-maṇḍala procedure in the midst of a great assembly, and any beings who hear this proclamation, who experience its sound falling on their ears, will have all their obscurations and nonvirtue purified.

source: སྡིག་པ་མི་ཟད་པ་ལས་བྲལ་བར་འགྱུར་རོ། །སྔོན་གྱི་སྒྲིབ་པ་དང་། སྡིག་པ་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ། །ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: They will be completely freed from their previously accumulated obscurations and evil, and they will reach the point of no return.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྲས་སུ་རིག་པར་བྱའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྲས་ཀྱི་ཐུ་བོ་ཡིན་ནོ།
en: They will all be known as children of the tathāgatas.

source: །རྟག་པར་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གྲོགས་མཛད་ཅིང་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རྟག་ཏུ་དབུགས་འབྱིན་པ་མཛད་པར་འགྱུར་རོ། །མཐར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གནས་ཀྱི་བར་དུ་རྟག་ཏུ་རྗེས་སུ་སྲུང་བར་མཛད་དོ།
en: They will have a bond with Noble Avalokiteśvara, who will always encourage and protect them until their final realization of awakening. “

source: །སེམས་ཅན་གང་ཞིག་དཀྱིལ་འཁོར་དེའི་ས་ཕྱོགས་སུ་སོང་སྟེ། ས་གཞི་སྣང་བ་ཙམ་མཐོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Even those beings who only approach the entrance to this maṇḍala and merely behold its ground will reach the point of no return.

source: །ཉོན་མོངས་པ་ཐམས་ཅད་བསྲེགས་ཤིང་སྒྲིབ་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: Their afflictions will burn away, and they will be freed from all obscurations.

source: །དེའི་ས་རྡུལ་རླུང་གིས་བདས་ཏེ་ལུས་ལ་ཕོག་པ་གང་ཡིན་པ་དེ་དང་། ཐ་ན་སེམས་ཅན་ངན་པ་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་གནས་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །སྡིག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བ་དང་།
en: When dust from this maṇḍala, carried on the wind, lands on the bodies of beings, they will all reach the point of no return and be freed from all their evil, even if they are wicked.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྟག་ཏུ་མཐོང་བ་དང་ལྡན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དགོངས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་དབུགས་ཕྱུང་བར་འགྱུར་རོ། །ལྷ་ཐམས་ཅད་ཀྱིས་བསྲུང་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara will always appear to them, all the tathāgatas will think of them, all the bodhisattvas will give them courage and comfort, and all deities will protect them.

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: Such beings will obtain a great amount of merit and plant many roots of virtue.

source: །དེ་ལྟར་ན་སྒྲ་ཐོས་པ་ཙམ་དང་། མིང་འཛིན་པ་ཙམ་གྱིས་འབྲས་བུ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ།
en: Thus, great results will be obtained merely by hearing about this maṇḍala and learning its name. “

source: །དེ་ནས་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་སྦྱིན་སྲེག་གི་ཆོ་ག་བཤད་པར་བྱ་སྟེ།
en: Now I will teach a homa procedure, a maṇḍala of liberation whereby the vidyā holder can incinerate all his evil and obscurations.

source: སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་སྲེག་ཅིང་སྡུག་བསྔལ་དྲག་པོ་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་བ་དང་། ཉོན་མོངས་པ་དྲག་པོའི་རྒྱ་མཚོ་དང་། འཁོར་བ་ལས་སྒྲོལ་བ་འགྲུབ་པ་ཕྱིར་མི་ལྡོག་པའི་གནས་བླ་ན་མེད་པར་དབུགས་འབྱིན་པར་མཛད་པ།
en: He will consequently be freed from all suffering, cross the ocean of saṃsāra with its vices and its dreadful afflictions, and reach the point of no return.

source: སངས་རྒྱས་ཐམས་ཅད་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་ལམ་སྟོན་པ། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོན་པ།
en: He will be comforted by all the buddhas and bodhisattvas, perceive their supreme supramundane path, and perceive the buddhas and bodhisattvas themselves.

source: ལྷའི་སྟེགས་སྦྱིན་སྲེག་བྱས་པ་ཙམ་གྱི་མོད་ལ་ཐེ་ཚོམ་མེད་པར་མེ་ལྷ་དང་། དབང་པོ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དབང་ཕྱུག་དང་།
en: He will reach the deities in an instant through the mere performance of homa; there is no doubt.

source: གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། གཞོན་ནུ་རྣམས་སྦྱིན་སྲེག་བྱས་པ་འདི་ཙམ་གྱི་མོད་ལ་ཐམས་ཅད་འོང་བར་འགྱུར་རོ། །ཐེ་ཚོམ་མེད་པར་ལྷ་དང་།
en: Brahmā, Indra, Viṣṇu, Maheśvara, Īśvara, Maheśvara, Yama, Varuṇa, Kubera, and Kumāra will all arrive instantly as soon as this homa is performed; there is no doubt. “

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: In the same instant, the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, rākṣasas, bhūtas, and kumbhāṇḍas will arrive and will all bow down at the vidyā holder’s feet.

source: སྲིན་པོ་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་ཐམས་ཅད་འོང་བར་འགྱུར་ཞིང་། དེའི་མོད་ལ་རིག་སྔགས་འཆང་བའི་རྐང་པ་གཉིས་ལ་རྟག་ཏུ་འདུད་པར་བྱེད་དོ། །དེ་བཞིན་དུ་ཉིན་མཚན་དུ་ཀུན་ཏུ་སྲུང་བར་འགྱུར་རོ།
en: They will protect him continually, day and night, in every way.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ཕྱག་ན་རྡོ་རྗེ་བདག་ཉིད་ཆེན་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་ཆེན་པོ་བཅུ་ཡང་ཕྱོགས་བཅུར་སྲུང་བར་བྱེད་དེ། མི་སྲུན་པ་མ་རུངས་པ་སེལ་ཅིང་དམྱལ་བ་དང་། འཇིགས་པ་མི་བཟད་པ་དང་། དུག་དྲག་པོ་དང་།
en: The Four Great Kings of noble nature, Vajrapāṇi and so forth, and the ten great yakṣa lords who guard the ten directions, will keep evil people and wicked beings away from him, will prevent the terrible terrors of hell, and will stop injustice.

source: སེམས་ཅན་མ་རུངས་པ་རྣམས་སེལ་བར་བྱེད་དོ། །དེ་མ་ཐག་ཏུ་བསོད་ནམས་ཆེན་པོའི་ལྷུན་པོ་དང་། བསོད་ནམས་ཆེན་པོའི་ཕུང་པོ་བླ་ན་མེད་པ་སྐྱེ་བར་འགྱུར་རོ།
en: From then on, all the wicked beings will be kept away from him, and he will accumulate a great heap of merit as big as Mount Sumeru. “

source: །ཙནྡན་སྲང་ཉི་ཤུ་དང་། ཨ་ག་རུ་སྲང་ལྔ་དང་། དུ་རུ་སྐ་སྲང་བདུན་དང་། ག་བུར་དང་། གླ་རྩི་སྲང་གཅིག་གི་བཞི་ཆ་རེ་རེ་དང་།
en: For this homa rite he should always use twenty palas of sandalwood, five palas of agarwood, seven palas of olibanum, a quarter pala of camphor and musk, one pala of saffron, five palas of frankincense, and seven palas of bdellium.

source: གུར་གུམ་སྲང་གཅིག་དང་། ལྕེ་བོག་ཀུན་དུ་ར་སྲང་ལྔ་དང་། གུ་གུལ་སྲང་བདུན་དང་འདི་རྣམས་གཅིག་ཏུ་བསྲེས་ཏེ། ཕྱེ་མར་བྱས་ལ་ཁར་དཀར་པོ་དང་།
en: Having ground the ingredients into a homogenous powder, the vidyā holder should mix it with white sugar and honey and make one thousand and eight pills, each the size of a die.

source: སྦྲང་རྩིས་རིལ་བུ་ཞོ་རེའི་ཚད་ཙམ་དུ་བྱས་པ་སྟོང་རྩ་བརྒྱད་དང་། ཡུངས་ཀར་དང་། འབྲས་ཡོས་བསྲེས་ཏེ། རིལ་བུ་དང་བསྲེས་ནས་མར་གྱི་ནང་དུ་སྨྱུགས་ཏེ་སྦྱིན་སྲེག་བྱའོ། །ཤིང་སྲུར་བྷི་དང་།
en: He should combine the pills with mustard seeds and parched rice, daub them in ghee, and offer them as one thousand and eight homas.

source: ཤིང་ཨརྐ་དང་། ཤིང་ཤ་མྱའི་ཡམ་སྲེག་ཤིང་གི་མེ་སྦར་ཏེ་སྦྱིན་སྲེག་གི་ཆོ་ག་བྱའོ།
en: He should kindle the fire with śamī sticks and use the sticks of surabhi and giant milkweed as fuel. “

source: །གང་དང་གང་གི་ཚེ་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན་དེ་དང་དེའི་ཚེ་སྡིག་པ་དང་། སྒྲིབ་པ་དྲག་པོ་ཐམས་ཅད་སྲེག་པར་འགྱུར་རོ། །དེ་དང་དེའི་ཚེ་དེ་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །དེ་དང་དེའི་ཚེ་གཅོད་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །དེ་དང་དེའི་ཚེ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་བུད་མེད་དང་།
en: As he then offers the one thousand and eight homas according to procedure, his evil, obscurations, and wrongdoings will all diminish proportionally, and he will become free from all disease.

source: སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་ལ་སོགས་པ་ཐམས་ཅད་ཀྱི་སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ། །སྡིག་པ་ཐམས་ཅད་དང་། བྱུར་ཐམས་ཅད་དང་། གནོད་པ་ཐམས་ཅད་དང་། འཁྲུག་པ་ཐམས་ཅད་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་།
en: Concurrently, all the obscurations and evil of all beings in Jambudvīpa—the women, men, boys, girls, monks, brahmins, kṣatriyas, vaiśyas, and śūdras—will gradually disappear.

source: གཡུལ་འགྱེད་པ་དང་། ཤགས་འགྱེད་པ་ཐམས་ཅད་དང་། རང་གི་འཁོར་དང་། གཞན་གྱི་འཁོར་གྱི་འཇིགས་པ་ཐམས་ཅད་དང་། ཕྱིར་རྒོལ་བའི་དགྲས་འཇིགས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་མ་རུངས་པ་ཐམས་ཅད་དང་།
en: All fears, disasters, misfortunes, calamities, epileptic fits, quarrels, disputes, and disagreements, all dangers from marauding armies, whether one’s own or the enemy’s, all dangers that originate from one’s adversaries and opponents, and all dangers from thieves, rogues, bandits, and wild animals will be pacified.

source: རྐུན་པོ་དང་། ཟོལ་བ་དང་། མི་རྒོད་པ་དང་། གཅན་གཟན་གཏུམ་པོའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་འཇིགས་པ་མེད་པར་འགྱུར་རོ། །བུད་མེད་དང་།
en: All affected beings will become free from fear. “

source: སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་གང་དག་གིས་དེའི་དྲི་ཚོར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་།
en: All beings who smell the fragrance of the homa—women, men, boys, girls, monks, brahmins, kṣatriyas, vaiśyas, and śūdras—will reach the point of no return and progress toward unsurpassable perfect awakening.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །ཚེ་བརྗེས་ནས་ཐམས་ཅད་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་འགྱུར་ཞིང་། པདྨོའི་ནང་ནས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: When they take a new birth, it will be in the realm of Sukhāvatī, where they will be spontaneously born from a lotus flower.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པ་རྐང་གཉིས་པ་དང་། རྐང་བཞི་པ་རྣམས་ཀྱིས་དེའི་དྲི་ཚོར་བ་ཙམ་གྱིས་ཐམས་ཅད་ངེས་པར་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Likewise, all animals who smell the fragrance, whether two- or four-footed, will certainly reach the point of no return through merely smelling it.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: They will fully awaken to perfect buddhahood, from which they cannot lapse. “

source: །རིག་སྔགས་འཆང་བ་དེ་ཇི་ལྟ་ཇི་ལྟར་སྦྱིན་སྲེག་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ངེའི་ལུས་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: As the vidyā holder progresses with the homa, his body will become increasingly pure and free of stain.

source: །སྟོང་རྩ་བརྒྱད་ཚང་ན་རིག་སྔགས་འཆང་བའི་ལུས་འབར་བར་འགྱུར་རོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་མང་པོའི་སྐུ་མཐོང་བར་འགྱུར་རོ།
en: When he has reached one thousand and eight homas, his body will blaze with light, and he will see the body of a buddha in each of the directions.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་གིས་རིག་སྔགས་འཆང་བ་ལ་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་ཏེ།
en: Each of these tathāgatas will applaud the vidyā holder, saying, ‘Good!

source: རིག་སྔགས་འཆང་བ་ལེགས་སོ་ལེགས་སོ།
en: It is good, vidyā holder!

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་མཆོག །རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་སྲེག་གི་ཆོ་ག་ཡིན་ནོ། །འདི་ནི་བདུད་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་སྦྱིན་སྲེག་ཆེན་པོའི་ཆོ་ག་ཡིན་ནོ། །འདི་ནི་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་།
en: This supramundane homa procedure constitutes a maṇḍala of liberation, the supreme secret of all the tathāgatas.

source: བརྗེད་བྱེད་དང་། བགེགས་དང་། ལོག་འདྲེན་ཚར་གཅོད་པའི་སྦྱིན་སྲེག་ཆེན་པོའི་ཆོ་ག་ཡིན་ནོ། །འདི་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་སྟེ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་སྦྱིན་སྲེག་ཆེན་པོའི་ཆོ་ག་ཡིན་ནོ།
en: This great homa procedure crushes all māras, eliminates yakṣas, rākṣasas, bhūtas, vighnas, vināyakas, and apasmāras, brings one toward the seat of awakening, and leads to the turning of the wheel of Dharma.

source: །འདི་ནི་བྱང་ཆུབ་ཀྱི་ལམ་བླ་ན་མེད་པ་ཡིན་ནོ།
en: It constitutes the supreme path to awakening.’

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཕྱག་གཡས་པ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བརྐྱང་སྟེ། རིག་སྔགས་འཆང་བའི་མགོའི་སྤྱི་བོ་ལ་ཕྱག་འཇོག་པར་མཛད་དོ།
en: Each tathāgata will then extend his golden right arm and place his hand on the vidyā holder’s head. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རང་གི་ངོ་བོ་ཉིད་ཀྱི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། དོན་ཡོད་པའི་ཞགས་པ་དང་།
en: Noble Avalokiteśvara will appear before the vidyā holder in person.

source: ཚངས་པའི་ཆ་བྱད་འཆང་བ། དབུ་ལྕང་ལོ་ཅོད་པན་གྱིས་བརྒྱན་པ། པདྨ་དང་། མདུང་རྩེ་གསུམ་པ་དང་། ཞགས་པ་ཐོགས་པ།
en: He will be adorned with every ornament, wear the Brahmā attire of Amoghapāśa, wear his hair in a topknot adorned with a diadem, and hold a lotus, a trident, and a noose in his hands.

source: རིག་སྔགས་འཆང་བའི་མདུན་ན་བཞུགས་ཏེ་བཀའ་སྩོལ་པ།
en: He will say to the vidyā holder, ‘Good!

source: རིག་སྔགས་འཆང་བ་ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་སྲེག་གི་ཆོ་ག་ཆེན་པོ་གྲུབ་པ་ལེགས་སོ་ལེགས་སོ།
en: Good it is, O vidyā holder! You have accomplished the supramundane homa procedure, a maṇḍala of liberation that is the heart essence of Amoghapāśa.

source: །ཟུང་ཤིག་དང་། མཆོག་ཇི་ལྟ་བ་དང་། ཇི་ལྟར་འདོད་པ་དེ་ཐམས་ཅད་སྦྱིན་ནོ།
en: You may choose a boon, and I will grant whatever you wish for in full.’

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་ཇི་ལྟར་འདོད་པའི་མཆོག་སྨྲས་ན་དེ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་རོ།
en: The vidyā holder should then state his desired boons, and he will obtain them all. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གིས་ཕྱག་བརྐྱང་སྟེ། རིག་སྔགས་འཆང་བའི་མགོའི་སྤྱི་བོ་ལ་ཕྱག་བཞག་པ་དང་།
en: Noble Avalokiteśvara will then extend his arm and place his hand on the vidyā holder’s head.

source: ཕྱག་བཞག་མ་ཐག་ཏུ་རིག་སྔགས་འཆང་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འགྲོ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བ་ཐོབ་པར་འགྱུར་རོ།
en: As soon as he places it there, the vidyā holder will ascend into the sky and visit the buddha fields in the ten directions, where he will meet all the tathāgatas face-to-face.

source: །ཕྱིར་མི་ལྡོག་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་གནས་ཐོབ་པར་འགྱུར་རོ།
en: He will reach the point of not turning back and become established in the state from which he cannot lapse.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞིང་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ་ཐོབ་པར་འགྱུར་རོ།
en: He will obtain a prophecy of his future realization from all the tathāgatas in all buddha fields.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞིང་ལ་བསྙེན་བཀུར་བྱས་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་འགྱུར་རོ།
en: Having traveled around all the buddha fields, he will visit the realm of Sukhāvatī.

source: །དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་བཅས་པ་ཆོས་འཆད་པ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་མངོན་སུམ་དུ་ཐོབ་པར་འགྱུར་རོ།
en: There he will sit opposite the Tathāgata Amitābha and his retinue and hear Dharma teachings from him until the attainment of final, ultimate realization. “

source: །དེ་ནས་ཧོ་མ་ཁུང་བཤད་པར་བྱ་སྟེ། འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་སྲེག་གི་གནས་བླ་ན་མེད་པའི་པདྨ་ཁ་བྱེ་བ་འདྲ་བར་བྱས་པ།
en: Now I will teach how to prepare a pit that will serve as the location for the supramundane homa.

source: ཟླུམ་པོ་ཁྲུ་གསུམ་པ་ས་དང་བའི་ལྕི་བ་བསྲེས་པ་དང་ལྡན་པར་བྱས་ཏེ། པདྨའི་སྙིང་པོ་ལ་ཧོ་མ་ཁུང་ཟ་བས་སུ་བརྐོ་བ་དང་།
en: The vidyā holder should draw a fully blooming lotus that is three cubits wide and daub it with a mixture of clay and cow dung.

source: ཐབ་ཀ་ཀུན་ཏུ་ཁྲུ་གང་བ་བརྐོ་བར་བྱའོ། །ནང་དུ་པདྨ་བཅུ་དྲུག་པ་འབུར་དུ་བྱས་པ་བཞག་ལ།
en: In the center, among the lotus filaments, he should dig a hole one cubit in diameter and arrange sixteen petals lying horizontally in a circle inside it.

source: ཚོན་སྣ་ཚོགས་ཀྱིས་པདྨ་དེ་བརྒྱན་པར་བྱའོ།
en: The lotus should be painted with various colors.

source: །པདྨའི་ཕྱི་འཁོར་དུ་དཀྱིལ་འཁོར་གྲུ་བཞིར་བྱས་ལ་དྲི་སྣ་ཚོགས་ཀྱིས་གཏོར་བ་དང་བརྒྱན་པར་བྱའོ།
en: He should then demarcate a square maṇḍala that surrounds the lotus and skillfully arrange various fragrant substances there.

source: །དཀྱིལ་འཁོར་ཀུན་ཏུ་བུམ་པ་གང་བ་བཞི་དང་། དངུལ་གྱི་སྣོད་གང་བ་བཞི་དང་། མཆོད་ཡོན་གྱི་ཆུས་བཀང་པ་གསེར་གྱི་སྣོད་བཞི་དང་།
en: He should distribute four full jars around the maṇḍala, four silver dishes filled with argha water for the feet, and four golden dishes filled with water perfumed with various fragrances. “

source: རོ་སྣ་ཚོགས་ཀྱི་གཏོར་མ་གཞག་པ་ནི་གཏོར་མ་དཀར་གསུམ་རྣམ་པ་སྣ་ཚོགས་དང་འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་གཞག་པ་དང་།
en: Around the maṇḍala he should arrange a bali of various flavors that consists of different preparations of the three ‘white’ foods and includes an assortment of fruits.

source: དྲི་དང་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཏོར་ཏེ། ཕྲེང་བ་རྣམ་པ་སྣ་ཚོགས་དཔྱངས་ལ། དཀྱིལ་འཁོར་ཀུན་དུ་ཚོན་སྣ་ལྔའི་བ་དན་གྱིས་མདའ་ལ་བརྒྱན་ཏེ་གཟུགས་པ་དང་།
en: He should then scatter flowers over them and add garlands of various kinds, along with arrows adorned with five colors of banners.

source: སྒོ་བཞི་ཆ་དབྱེ་བ་དང་། བུམ་པ་གཞག་པ་ནི་ལེགས་པར་བརྒྱན་ཅིང་དྲི་ཆུས་ཡོངས་སུ་བཀང་བར་བྱའོ། །སྒོ་བཞིར་ཆོས་སྨྲ་བ་ཤིན་ཏུ་བརྒྱན་པའི་སྟན་ལ་འདུག་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཀླག་པར་བྱའོ།
en: At each of the four doors he should place a nicely adorned jar filled with perfumed water and read the Prajñāpāramitā while seated on a well-adorned seat fit for a Dharma teacher.

source: །གྲྭ་བཞིར་ཆོ་ག་སྨྲ་བ་ཆོས་ཀྱི་སྟན་ལེགས་པར་བརྒྱན་པ་ལ་འདུག་ནས་དོན་ཡོད་པའི་ཞགས་པའི་མདོ་སྡེ་བཀླག་པར་བྱའོ།
en: In the four corners he should read the Amogha­pāśa Sūtra aloud while seated upon a well-adorned Dharma seat fit for a Dharma teacher.

source: །གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་དང་། ཟངས་ཀྱི་མེ་ཏོག་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་མཆོད་པར་བྱའོ།
en: He should offer golden, silver, and copper flowers, as well as the seven precious jewels. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་ཁྲུས་བྱས་གོས་གཙང་མ་བགོས་དྲི་ཞིམ་པོས་བགོས་ཏེ། གཙང་མར་བྱས་པ་ལ་རིལ་བུ་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་ཀྱིས་དབང་བསྐུར་རོ། །དོན་ཡོད་པ་རྣམ་པར་ལྟ་བའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱའོ།
en: Then, ritually pure, thoroughly bathed, dressed in clean clothes, and perfumed with pleasing fragrances, he should incant one thousand and eight pills one hundred and eight times with the heart mantra of Amoghapāśa, consecrate the pills with the mantra of Krodharāja one hundred and eight times, and recite the heart mantra of Amoghavilokita one hundred and eight times.

source: །དེ་ནས་དོན་ཡོད་པ་རྣམ་པར་ལྟ་བའི་འབར་བ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཞགས་པའི་སྙིང་པོས་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱ་བ་ནི་མི་སྨྲ་བར་བྱམས་པའི་སེམས་དང་། སྙིང་ཐག་པ་ནས་བརྩེ་བ་དང་། སྙིང་རྗེ་བར་བྱ་བ་ནི་ལས་བླ་ན་མེད་པ་ཡིན་ནོ།
en: After that, he should offer one thousand and eight pills into the fire while reciting, without saying anything else, the heart mantra of Amoghapāśa called the liberating maṇḍala of fire as he generates a loving mind and a compassionate and kind heart. “
